chore: Updated docs/architecture and AI-pipeline  and ReadMe (root) files
